INSERT INTO genre(genre_name)
VALUES ('PUNK'), ('ROCK'), ('POP'), ('ALTERNATIVE');

INSERT INTO artist(artist_name)
VALUES ('SUM 41'), ('Король и Шут'), ('Элизиум'),
       ('AC DC'), ('Gorillaz'), ('КИНО'),
       ('Zaz'), ('Zivert'), ('AQUA'),
       ('Papa Roach'), ('KORN'), ('AMATORY');

INSERT INTO genre_artist(genre_id, artist_id)
VALUES (1, 1), (1, 2), (1, 3), (2, 2), (2, 4), (2, 5), (2, 6),
       (3, 3), (3, 7), (3, 8), (3, 9), (4, 10), (4, 11), (4, 12);

INSERT INTO album(album_name, release_year)
VALUES ('13 Voices', 2016), ('Order in Decline', 2019),
       ('Герои и Злодеи', 2010), ('Как в старой сказке', 2001),
       ('Все острова', 2002), ('Космос', 2003),
       ('Rock or Bust', 2014), ('Power Up', 2020),
       ('Gorillaz', 2000), ('Demon Days', 2005),
       ('Вымышленный альбом', 2023), ('Звезда по имени Солнце', 1989),
       ('Черный альбом', 1990), ('Effet miroir', 2018), ('Vinyl #1', 2019), ('Aquarius', 2000),
       ('Megalomania', 2011), ('Crooked Teeth', 2017), ('Who Do You Trust?', 2019),
       ('The Nothing', 2019), ('Requiem', 2022), ('Инстинкт обречённых', 2010);

INSERT INTO album_artist(album_id, artist_id)
VALUES (1, 1), (2, 1), (3, 2), (4, 2), (5, 3), (6, 3), (7, 4),
       (8, 4), (9, 5), (10, 5), (11, 6), (11, 12), (12, 6), (13, 6),
       (14, 7), (15, 8), (16, 9), (17, 9), (18, 10), (19, 10), (20, 11), (21, 11), (22, 12);

INSERT INTO tracks(track_name, track_time, album_id)
VALUES ('A Murder of Crows', '00:03:04', 1), ('Goddamn Im Dead Again', '00:03:22', 1), ('Fake My Own Death', '00:03:14', 1),
       ('Turning Away', '00:03:50', 2), ('Out For Blood', '00:03:36', 2), ('The New Sensation', '00:03:50', 2),
       ('Запрет отца', '00:03:31', 3), ('Вор, граф и графиня', '00:02:55', 3), ('Невеста палача', '00:04:22', 3),
       ('Проклятый старый дом', '00:04:17', 4), ('Тайна хозяйки старинных часов', '00:03:30', 4), ('Кузьма и барин', '00:03:08', 4),
       ('Алкогольная', '00:03:38', 5), ('Альпинист', '00:02:23', 5), ('Острова', '00:03:21', 5),
       ('Время не ждёт', '00:02:22', 6), ('Ослепительный мир', '00:03:45', 6), ('Солнце', '00:02:15', 6),
       ('Rock or Bust', '00:03:03', 7), ('Play Ball', '00:02:47', 7), ('Rock the Blues Away', '00:03:24', 7),
       ('Realize', '00:03:37', 8), ('Rejection', '00:04:06', 8), ('Shot in the Dark[en]', '00:03:06', 8),
       ('Re-Hash',  '00:03:37', 9), ('5/4', '00:02:39', 9), ('Tomorrow Comes Today', '00:03:12', 9),
       ('Last Living Souls', '00:03:10', 10), ('Kids With Guns', '00:03:45', 10), ('O Green World', '00:04:31', 10),
       ('Песня без слов', '00:05:06', 12), ('Звезда по имени Солнце', '00:03:45', 12), ('Невесёлая песня', '00:04:18', 12),
       ('Кончится лето', '00:05:55', 13), ('Красно-жёлтые дни', '00:05:49', 13), ('Нам с тобой', '00:04:49', 13),
       ('On sen remet jamais', '00:03:19', 14), ('Jaime jaime', '00:03:26', 14), ('Mes souvenirs de toi', '00:03:29', 14),
       ('Fly', '00:03:13', 15), ('Бродяга-дождь', '00:03:35', 15), ('Credo', '00:03:04', 15),
       ('Шарик', '00:03:06', 15), ('Back from Mars', '00:04:03', 16), ('Aquarius', '00:04:21', 16),
       ('Kill Myself', '00:03:31', 17), ('Like A Robot', '00:03:39', 17), ('Viva Las Vegas', '00:03:24', 17),
       ('Break the Fall', '00:03:10', 18), ('Crooked Teeth', '00:03:03', 18), ('My Medication', '00:03:15', 18),
       ('Renegade Music', '00:03:20', 19), ('Cold', '00:03:46', 20), ('This Loss', '00:04:41', 20),
       ('Penance To Sorrow', '00:03:20', 21), ('My Confession', '00:03:34', 21), ('Worst Is On Its Way', '00:04:03', 21),
       ('Белый шум', '00:03:40', 22), ('Инферно', '00:03:40', 22), ('F20', '00:03:39', 22),
       ('Молчи!', '00:03:46', 22), ('Горизонты снов', '00:04:05', 22);

INSERT INTO collections(collection_name, release_year)
VALUES ('Песни КиШа', 2023), ('Потяжелее', 2020), ('Pop', 2019), ('Солянка', 2022);

INSERT INTO track_collections(track_id, collection_id)
VALUES (7, 1), (8, 1), (9, 1), (10, 1), (11, 1), (12, 1),
       (49,2), (50, 2), (51, 2), (52, 2), (53, 2), (54, 2),
       (19, 3), (20, 3), (21, 3), (22, 3),
       (1, 4), (15, 4), (23, 4);